# Дан ряд целых чисел от 0 до 15 включительно. Используя цикл for, выведите на экран весь ряд.
# Результатом работы программы должен быть вывод в ячейке:
# 0
# 1
# 2
# 3
# 4
# ... и т. д.
for i in range(0,16):
  print(i)